{
  "name": "petjofi/krivoshiev.com",
  "version": "0.1.4",
  "libraries": {
    "xv": "^1.1.25"
  },
  "title": "Krivoshiev.com",
  "branch": "master",
  "style": {
    "name": "Material",
    "componentSet": {
      "nav": "nav/DarkAbsoluteNav",
      "header": "header/GradientHeader",
      "article": "article/BasicArticle",
      "footer": "footer/BasicFooter"
    },
    "fontFamily": "Roboto, sans-serif",
    "heading": {
      "fontWeight": 500,
      "letterSpacing": "-0.01em"
    },
    "colors": {
      "text": "#212121",
      "background": "#fff",
      "primary": "#2196f3",
      "secondary": "#1565c0",
      "highlight": "#ff4081",
      "border": "#e0e0e0",
      "muted": "#f5f5f5"
    },
    "layout": {
      "centered": true,
      "bannerHeight": "80vh",
      "maxWidth": 896
    }
  },
  "content": [
    {
      "component": "nav",
      "links": [
        {
          "href": "https://github.com/petjofi/krivoshiev.com",
          "text": "GitHub"
        }
      ]
    },
    {
      "component": "header",
      "heading": "krivoshiev.com",
      "subhead": null,
      "children": [
        {
          "component": "ui/TweetButton",
          "text": "krivoshiev.com: ",
          "url": null
        },
        {
          "component": "ui/GithubButton",
          "user": "petjofi",
          "repo": "krivoshiev.com"
        }
      ]
    },
    {
      "component": "article",
      "metadata": {
        "source": "github.readme"
      },
      "html": "<p>&#x41C;y name is Petar Krivoshiev.</p>\n<p>I am an Entrepreneur, Software Developer and Project Manager with more than 15 years experience in the field.</p>\n<h2>Philosophy</h2>\n<p>Don&apos;t just write code, be a <strong>code poet</strong> instead!</p>\n<h2>Technology</h2>\n<h3>Favourite Setup</h3>\n<p>I love Python and Django, Angular2 and Node. Jira and Git are priceless.</p>\n<h3>Mostly Used</h3>\n<p>I have experience with many different technologies but mostly with PHP, VB.NET, Javascript, AngularJS, SQL. My experience in the machine industry in Germany taught me how to use all kinds of tools efficiently and to quickly deliver qualitative solutions.</p>\n<h3>Other</h3>\n<p>I learned to use Java for Android projects, Objective-C for some iOS applications and I started with Swift with my colleges at Codeberry when it first came out. \n</p>\n<h2>Story</h2>\n<p>I was born in the small town of Asenovgrad, Bulgaria. I have had an interest for technology for as long as I can remember.\nOne of my earliest memories is my grandfather leading me to a small room in the building he worked at. There I saw Pravetz 8 for the first time. It was our &quot;nation&#x2019;s pride&quot; product, copy of the legendary Apple-I and II.\nBack then it was not easy to get access to such an amazing thing. So when I had the opportunity to go to the High School of Mathematics I did not hesitate. We were the youngest students in an experimental class and we had a lot of fun with some of the first computers and robots.</p>\n<p>I still can not explain why couple of years later my father decided to buy me a personal computer. It was such an expensive thing. Bulgaria was transitioning to democracy and the crisis was widespread. My 286XT costed a fortune - more than a regular car.\nBut that way I had the miracle right at home and next to playing games I was getting familiar with Basic, Pascal and even Delphi.</p>\n<p>The next couple of years were quite busy. I entered the German language school.\nLanguages were not my strong side. Years later I will be very thankful to my German teachers for their patience.\nNow, after fifteen years in Germany I am a fluent German speaker and I really appreciate it. </p>\n<p>After finishing high school I went to the Plovdiv University majoring in Engineering Physics. A that time I was presented with the surprising opportunity to start my first private business - an advertising agency with the bombastic name &quot;Triad of the United Future Arts&quot; (TUFA). Remembering the name after twenty years still makes me smile. And so began my history as an entrepreneur. Making business back then in Bulgaria was really hard and after four years I had to move on.</p>\n<p>At that time I was already busy finding my way out of Bulgaria and after a short carrier as an IT Administrator I bought my first ticket to Berlin, Germany. To me it seemed as an amazing place. The Physics Department had a brand new library with hundreds of modern computers, compared to our 4 old school PCs it was like traveling in time. \nLectures in quantum physics rotated with short-term student jobs until one day I met my future friends at Jonas &amp; Redmann. It is a leading German industry automation company specialising in building machines for the solar sector. I first started with small contract jobs, and soon I saw an opportunity to make a huge optimisation at the logistics department. I started with a simple stock module mirroring their existing logic. I optimised and documented the process and developed a sophisticated method to search for existing parts in a huge database. Each one of our machines was unique, and client specific, but most of their parts were identical.\nWe had the valuable data of how often a single part is used. This allowed us to meet ridiculous deadlines and be ahead of the competition. With the support of my manager we soon had a fast growing self-made planning tool covering Finance, Purchase, Sales, Engineering, Distribution.</p>\n<p>(to be continued)</p>\n"
    },
    {
      "component": "footer",
      "links": [
        {
          "href": "https://github.com/petjofi/krivoshiev.com",
          "text": "GitHub"
        },
        {
          "href": "https://github.com/petjofi",
          "text": "petjofi"
        }
      ]
    }
  ]
}